#include <iostream>

using namespace std;

int main()
{
    //Begin 10. Дано два кола із загальним центром і радіусами R1 і R2 (R1 > R2). 
    //Знайти площі цих кіл S1 і S2, а також площа S3 кільця, 
    //зовнішній радіус якого дорівнює R1,а внутрішній радіус дорівнює R2: 
    //S1 = π · (R1) 2, S2 = π · (R2) 2, S3 = S1 - S2. 
    //Значення π вважати рівним 3.14.
    // декларації
    float R1, R2, S1, S2, S3;
    const float pi = 3.14;
    //введення
    cout << "Введіть радіуси R1, R2: ";
    cin >> R1 >> R2;
    //обчислення
    S1 = pi * R1 * R1;
    S2 = pi * R2 * R2;
    S3 = S1 - S2;
    //виведення
    cout << "Площа S1 = " << S1 << endl;
    cout << "Площа S2 = " << S2 << endl;
    cout << "Площа S3 = " << S3 << endl;
    return 0;
}

